# Grouping in SQL

This notebook specifically covers the `GROUP BY` clause and the different concepts covered here are as follows:

- Basic `GROUP BY` Clause
- Sorting with `GROUP BY`
- Filtering with `GROUP BY`
    - Filtering with `HAVING` Clause
    - Filtering with `WHERE` Clause

### Connecting to DemoDB Database

The following query connects to the DemoDB database

In [1]:
USE DemoDB
GO

### Basic `GROUP BY` Clause

The following query executes the aggregated numbers from the `characters` table

In [7]:
SELECT 
    COUNT(id) AS 'Total Characters',
    SUM(salary) AS 'Total Salary',
    MIN(salary) AS 'Minimum Salary',
    MAX(salary) AS 'Maximum Salary',
    AVG(salary) AS 'Average Salary'
FROM
    dbo.characters

Total Characters,Total Salary,Minimum Salary,Maximum Salary,Average Salary
10,44438,2283,6338,4443

The following query executes the aggregated salary by cities from the `characters` table

In [6]:
SELECT 
    city,
    SUM(salary) AS 'Total Salary'
FROM
    dbo.characters
GROUP BY
    city

city,Total Salary
London,15739
New York,11783
Sydney,16916

### Sorting with `GROUP BY`

The following query executes the total number of characters along with the aggregated salary by `'city'` and `'gender'` columns sorted in ascending order of city name followed by the ascending order of gender

In [10]:
SELECT 
    city,
    gender,
    COUNT(id) AS 'Total Characters',
    SUM(salary) AS 'Total Salary'
FROM
    dbo.characters
GROUP BY
    city, gender
ORDER BY
    city, gender

city,gender,Total Characters,Total Salary
London,Female,1,2395
London,Male,3,13344
New York,Female,3,11783
Sydney,Female,1,5424
Sydney,Male,2,11492

### Filtering with `GROUP BY`

The `HAVING` clause is used to filter the grouped results, however, we can also use the `WHERE` clause but, it needs to come in the SQL statement before the `GROUP BY` clause

#### Filtering with `HAVING` Clause

The following query executes the total number of characters along with the aggregated salary by `'city'` and `'gender'` columns sorted by the descending order of salary and when the gender is `'Female'`

In [14]:
SELECT 
    city,
    gender,
    COUNT(id) AS 'Total Characters',
    SUM(salary) AS 'Total Salary'
FROM
    dbo.characters
GROUP BY
    city, gender
HAVING
    gender = 'Female'
ORDER BY
    [Total Salary] DESC

city,gender,Total Characters,Total Salary
New York,Female,3,11783
Sydney,Female,1,5424
London,Female,1,2395

#### Filtering with `WHERE` Clause

The following query executes the total number of characters along with the aggregated salary by `'city'` and `'gender'` columns sorted by the descending order of salary and when the gender is `'Male'`

In [1]:
SELECT 
    city,
    gender,
    COUNT(id) AS 'Total Characters',
    SUM(salary) AS 'Total Salary'
FROM
    dbo.characters
GROUP BY
    city, gender
HAVING
    gender = 'Male'
ORDER BY
    [Total Salary] DESC

city,gender,Total Characters,Total Salary
London,Male,3,13344
Sydney,Male,2,11492